// 6.12 指针与一维二维数组
#include <stdio.h>

int main() 
{
    int a[] = {1,2,3,4,5};
    char T[] = "true", F[] = "false";
    /// 简便写法
    ///     &a[i] == a+i
    ///     a[i]  == *(a+i)
    for (int i=0; i<5; i++) {
        // 验证一维数组 指针 = &值
        printf("&a[%d] == a+%d: %s\n", i,i,(&a[i]==a+i)?T:F);
        // 验证一维数组 值 = *指针
        printf("a[%d]  == *(a+%d): %s\n", i,i,(a[i]==*(a+i))?T:F);
    }

    int c[3][3] = {1,2,3, 4,5,6, 7,8,9};
    int *p, *q;
    p = &a[0];
    q = &c[1][2];
    /// pointer = &value 指针 = &值
    /// 一维数组            二维数组
    /// p = &a[0]           p = &a[0][0]
    ///   p == a+0 == a       p == a[0]+0 == a[0]
    ///                         == *(a+0) == *a
    /// q = &c[1]           q = &c[1][2]
    ///   q == c+1            q == c[1]+2 == *(c+1)+2
    
    // 验证二维数组 指针 = &值
    printf("q == c[1]+2 == *(c+1)+2: %s\n", 
            (q==c[1]+2 && q==(*(c+1)+2))?T:F);


    /// value = *pointer 值 = *指针
    /// 一维数组            二维数组
    /// a[0] == *a          a[0][0] == *a
    ///      == *p                  == *p
    /// c[1] == *(c+1)      c[1][2] == *(*(c+1)+2)
    ///      == *q                  == *q
    
    // 验证二维数组 值 = *指针
    printf("c[1][2] == *(*(c+1)+2) == *q: %s\n", 
            (c[1][2]==*q && *(*(c+1)+2)==*q)?T:F);
    return 0;
}