% 1-多行
[ 1 2 3 
  4 5 6
  7 8 9]
% 2-单行模式
[ 1 2 3; 4 5 6; 7 8 9]
% 分隔符可以是 ","或" "

% 构造矩阵
m=[1 2 3;4 5 6;7 8 9]
[m m+10; m+20 m+30]

%% 特殊矩阵
% 零矩阵
zeros(5)    % O_5x5
zeros(1,5)  % O_1x5
% 单位阵
eye(5)
% 全1阵
ones(4)
% 随机矩阵
rand(5)
% 随机正态矩阵

%% 矩阵操作
% 矩阵的保存、读取
% `save FILENAME`   % 保存工作区里的所有变量
% `save FILENAME A B ...`   % 保存矩阵A,B 为文件A.mat
% `load FILENAME`   % 读取保存的文件; FILENAME 可以不带扩展名

% 矩阵元素的引用
% A(i,j)
% A(k)

% 矩阵元素的删除
% A(:,j) = []
% A(i,:) = []

% 矩阵运算
% `+, -, *`
% `.*`  点乘：按对应的元素相乘

% `/, \`
% `./, .\` 点除：对应元素相除

% `'`   转置
% det(A)    行列式
% `inv(A)` or `A^(-1)`   求逆
% trace(A)    迹
% rank(A)     秩
